irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_adc_515_IUT.c
  CS_CMM_PROBE_NODE_STMT(2,4,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(2,3,1) if (ADCx == ((ADC_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2400)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable13,12) 

    
    CS_CMM_PROBE_NODE_STMT(2,2,2) RCC_APB2PeriphResetCmd(((uint32_t)0x00000200), ENABLE);

    RCC_APB2PeriphResetCmd(((uint32_t)0x00000200), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(2,1,3) if (ADCx == ((ADC_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2800)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable14,13) 

    
    CS_CMM_PROBE_NODE_STMT(2,0,4) RCC_APB2PeriphResetCmd(((uint32_t)0x00000400), ENABLE);

    RCC_APB2PeriphResetCmd(((uint32_t)0x00000400), DISABLE);
  }
  else
  {
    
    CS_CMM_PROBE_NODE_STMT(3,7,5) if (ADCx == ((ADC_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x3C00)))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable15,14) 

      
      CS_CMM_PROBE_NODE_STMT(3,6,6) RCC_APB2PeriphResetCmd(((uint32_t)0x00008000), ENABLE);

      RCC_APB2PeriphResetCmd(((uint32_t)0x00008000), DISABLE);
    } CS_CMM_ELSE_PROBE_C1(15) 
  }
  }

CS_CMM_PROBE_NODE_STMT(3,5,7) 
 CODESCROLL_FUNC_END(5, 1, 207) } CODESCROLL_FUNC_END_RBRACE 
/* # 217 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_Init(ADC_TypeDef* ADCx, ADC_InitTypeDef* ADC_InitStruct)
{ CODESCROLL_FUNC_BEGIN(6, (6, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable16,16) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable17,3,4,0)

  uint32_t tmpreg1 = 0;
  uint8_t tmpreg2 = 0;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);



  tmpreg1 = ADCx->CR1;

  tmpreg1 &= ((uint32_t)0xFFF0FEFF);



  tmpreg1 |= (uint32_t)(ADC_InitStruct->ADC_Mode | ((uint32_t)ADC_InitStruct->ADC_ScanConvMode << 8));

  ADCx->CR1 = tmpreg1;



  tmpreg1 = ADCx->CR2;

  tmpreg1 &= ((uint32_t)0xFFF1F7FD);




  tmpreg1 |= (uint32_t)(ADC_InitStruct->ADC_DataAlign | ADC_InitStruct->ADC_ExternalTrigConv |
            ((uint32_t)ADC_InitStruct->ADC_ContinuousConvMode << 1));

  ADCx->CR2 = tmpreg1;



  tmpreg1 = ADCx->SQR1;

  tmpreg1 &= ((uint32_t)0xFF0FFFFF);


  tmpreg2 |= (uint8_t) (ADC_InitStruct->ADC_NbrOfChannel - (uint8_t)1);
  tmpreg1 |= (uint32_t)tmpreg2 << 20;

  ADCx->SQR1 = tmpreg1;

CS_CMM_PROBE_NODE_STMT(3,3,1) 
 CODESCROLL_FUNC_END(6, 1, 267) } CODESCROLL_FUNC_END_RBRACE 






void ADC_StructInit(ADC_InitTypeDef* ADC_InitStruct)
{ CODESCROLL_FUNC_BEGIN(7, (7, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable18,17) 


  
  CS_CMM_PROBE_NODE_STMT(3,2,0) ADC_InitStruct->ADC_Mode = ((uint32_t)0x00000000);

  ADC_InitStruct->ADC_ScanConvMode = DISABLE;

  ADC_InitStruct->ADC_ContinuousConvMode = DISABLE;

  ADC_InitStruct->ADC_ExternalTrigConv = ((uint32_t)0x00000000);

  ADC_InitStruct->ADC_DataAlign = ((uint32_t)0x00000000);

  ADC_InitStruct->ADC_NbrOfChannel = 1;

CS_CMM_PROBE_NODE_STMT(3,1,1) 
 CODESCROLL_FUNC_END(7, 1, 289) } CODESCROLL_FUNC_END_RBRACE 
/* # 298 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_Cmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(8, (8, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable19,18) 

  
  CS_CMM_PROBE_NODE_STMT(3,0,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(4,7,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable20,19) 

    
    CS_CMM_PROBE_NODE_STMT(4,6,2) ADCx->CR2 |= ((uint32_t)0x00000001);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable21,20) 

    
    CS_CMM_PROBE_NODE_STMT(4,5,3) ADCx->CR2 &= ((uint32_t)0xFFFFFFFE);
  }

CS_CMM_PROBE_NODE_STMT(4,4,4) 
 CODESCROLL_FUNC_END(8, 1, 313) } CODESCROLL_FUNC_END_RBRACE 
/* # 323 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_DMACmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(9, (9, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable22,21) 

  
  CS_CMM_PROBE_NODE_STMT(4,3,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(4,2,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable23,22) 

    
    CS_CMM_PROBE_NODE_STMT(4,1,2) ADCx->CR2 |= ((uint32_t)0x00000100);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable24,23) 

    
    CS_CMM_PROBE_NODE_STMT(4,0,3) ADCx->CR2 &= ((uint32_t)0xFFFFFEFF);
  }

CS_CMM_PROBE_NODE_STMT(5,7,4) 
 CODESCROLL_FUNC_END(9, 1, 338) } CODESCROLL_FUNC_END_RBRACE 
/* # 352 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_ITConfig(ADC_TypeDef* ADCx, uint16_t ADC_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(10, (10, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable25,24) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable26,5,6,0)

  uint8_t itmask = 0;

  ((void)0);
  ((void)0);
  ((void)0);

  itmask = (uint8_t)ADC_IT;
  
  CS_CMM_PROBE_NODE_STMT(5,5,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable27,25) 

    
    CS_CMM_PROBE_NODE_STMT(5,4,2) ADCx->CR1 |= itmask;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable28,26) 

    
    CS_CMM_PROBE_NODE_STMT(5,3,3) ADCx->CR1 &= (~(uint32_t)itmask);
  }

CS_CMM_PROBE_NODE_STMT(5,2,4) 
 CODESCROLL_FUNC_END(10, 1, 371) } CODESCROLL_FUNC_END_RBRACE 






void ADC_ResetCalibration(ADC_TypeDef* ADCx)
{ CODESCROLL_FUNC_BEGIN(11, (11, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable29,27) 

  
