irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_adc_515_IUT.c
  CS_CMM_PROBE_NODE_STMT(5,1,0) ((void)0);

  ADCx->CR2 |= ((uint32_t)0x00000008);

CS_CMM_PROBE_NODE_STMT(5,0,1) 
 CODESCROLL_FUNC_END(11, 1, 384) } CODESCROLL_FUNC_END_RBRACE 






FlagStatus ADC_GetResetCalibrationStatus(ADC_TypeDef* ADCx)
{ CODESCROLL_FUNC_BEGIN(12, (12, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable30,28) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable31,6,7,0)

  FlagStatus bitstatus = RESET;

  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(6,6,1) if ((ADCx->CR2 & ((uint32_t)0x00000008)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable32,29) 

    
    CS_CMM_PROBE_NODE_STMT(6,5,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable33,30) 

    
    CS_CMM_PROBE_NODE_STMT(6,4,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(6,3,4) 
   CODESCROLL_FUNC_END(12, 1, 408) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 






void ADC_StartCalibration(ADC_TypeDef* ADCx)
{ CODESCROLL_FUNC_BEGIN(13, (13, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable34,31) 

  
  CS_CMM_PROBE_NODE_STMT(6,2,0) ((void)0);

  ADCx->CR2 |= ((uint32_t)0x00000004);

CS_CMM_PROBE_NODE_STMT(6,1,1) 
 CODESCROLL_FUNC_END(13, 1, 422) } CODESCROLL_FUNC_END_RBRACE 






FlagStatus ADC_GetCalibrationStatus(ADC_TypeDef* ADCx)
{ CODESCROLL_FUNC_BEGIN(14, (14, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable35,32) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable36,6,0,0)

  FlagStatus bitstatus = RESET;

  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(7,7,1) if ((ADCx->CR2 & ((uint32_t)0x00000004)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable37,33) 

    
    CS_CMM_PROBE_NODE_STMT(7,6,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable38,34) 

    
    CS_CMM_PROBE_NODE_STMT(7,5,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(7,4,4) 
   CODESCROLL_FUNC_END(14, 1, 446) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 456 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_SoftwareStartConvCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(15, (15, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable39,35) 

  
  CS_CMM_PROBE_NODE_STMT(7,3,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(7,2,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable40,36) 


    
    CS_CMM_PROBE_NODE_STMT(7,1,2) ADCx->CR2 |= ((uint32_t)0x00500000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable41,37) 


    
    CS_CMM_PROBE_NODE_STMT(7,0,3) ADCx->CR2 &= ((uint32_t)0xFFAFFFFF);
  }

CS_CMM_PROBE_NODE_STMT(8,7,4) 
 CODESCROLL_FUNC_END(15, 1, 473) } CODESCROLL_FUNC_END_RBRACE 






FlagStatus ADC_GetSoftwareStartConvStatus(ADC_TypeDef* ADCx)
{ CODESCROLL_FUNC_BEGIN(16, (16, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable42,38) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable43,8,6,0)

  FlagStatus bitstatus = RESET;

  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(8,5,1) if ((ADCx->CR2 & ((uint32_t)0x00400000)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable44,39) 

    
    CS_CMM_PROBE_NODE_STMT(8,4,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable45,40) 

    
    CS_CMM_PROBE_NODE_STMT(8,3,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(8,2,4) 
   CODESCROLL_FUNC_END(16, 1, 497) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 508 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_DiscModeChannelCountConfig(ADC_TypeDef* ADCx, uint8_t Number)
{ CODESCROLL_FUNC_BEGIN(17, (17, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable46,41) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable47,8,1,0)

  uint32_t tmpreg1 = 0;
  uint32_t tmpreg2 = 0;

  ((void)0);
  ((void)0);

  tmpreg1 = ADCx->CR1;

  tmpreg1 &= ((uint32_t)0xFFFF1FFF);

  tmpreg2 = Number - 1;
  tmpreg1 |= tmpreg2 << 13;

  ADCx->CR1 = tmpreg1;

CS_CMM_PROBE_NODE_STMT(8,0,1) 
 CODESCROLL_FUNC_END(17, 1, 524) } CODESCROLL_FUNC_END_RBRACE 
/* # 535 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_DiscModeCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(18, (18, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable48,42) 

  
  CS_CMM_PROBE_NODE_STMT(9,7,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(9,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable49,43) 

    
    CS_CMM_PROBE_NODE_STMT(9,5,2) ADCx->CR1 |= ((uint32_t)0x00000800);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable50,44) 

    
    CS_CMM_PROBE_NODE_STMT(9,4,3) ADCx->CR1 &= ((uint32_t)0xFFFFF7FF);
  }

CS_CMM_PROBE_NODE_STMT(9,3,4) 
 CODESCROLL_FUNC_END(18, 1, 550) } CODESCROLL_FUNC_END_RBRACE 
/* # 589 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_RegularChannelConfig(ADC_TypeDef* ADCx, uint8_t ADC_Channel, uint8_t Rank, uint8_t ADC_SampleTime)
{ CODESCROLL_FUNC_BEGIN(19, (19, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable51,45) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable52,9,2,0)

  uint32_t tmpreg1 = 0, tmpreg2 = 0;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(9,1,1) if (ADC_Channel > ((uint8_t)0x09))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable53,46) 

    
