irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_adc_515_IUT.c
    CS_CMM_PROBE_NODE_STMT(9,0,2) tmpreg1 = ADCx->SMPR1;

    tmpreg2 = ((uint32_t)0x00000007) << (3 * (ADC_Channel - 10));

    tmpreg1 &= ~tmpreg2;

    tmpreg2 = (uint32_t)ADC_SampleTime << (3 * (ADC_Channel - 10));

    tmpreg1 |= tmpreg2;

    ADCx->SMPR1 = tmpreg1;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable54,47) 

    
    CS_CMM_PROBE_NODE_STMT(10,7,3) tmpreg1 = ADCx->SMPR2;

    tmpreg2 = ((uint32_t)0x00000007) << (3 * ADC_Channel);

    tmpreg1 &= ~tmpreg2;

    tmpreg2 = (uint32_t)ADC_SampleTime << (3 * ADC_Channel);

    tmpreg1 |= tmpreg2;

    ADCx->SMPR2 = tmpreg1;
  }

  
  CS_CMM_PROBE_NODE_STMT(10,6,4) if (Rank < 7)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable55,48) 

    
    CS_CMM_PROBE_NODE_STMT(10,5,5) tmpreg1 = ADCx->SQR3;

    tmpreg2 = ((uint32_t)0x0000001F) << (5 * (Rank - 1));

    tmpreg1 &= ~tmpreg2;

    tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 1));

    tmpreg1 |= tmpreg2;

    ADCx->SQR3 = tmpreg1;
  }

  else { 
  CS_CMM_PROBE_NODE_STMT(10,4,6) if (Rank < 13)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable56,49) 

    
    CS_CMM_PROBE_NODE_STMT(10,3,7) tmpreg1 = ADCx->SQR2;

    tmpreg2 = ((uint32_t)0x0000001F) << (5 * (Rank - 7));

    tmpreg1 &= ~tmpreg2;

    tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 7));

    tmpreg1 |= tmpreg2;

    ADCx->SQR2 = tmpreg1;
  }

  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable57,50) 

    
    CS_CMM_PROBE_NODE_STMT(10,2,8) tmpreg1 = ADCx->SQR1;

    tmpreg2 = ((uint32_t)0x0000001F) << (5 * (Rank - 13));

    tmpreg1 &= ~tmpreg2;

    tmpreg2 = (uint32_t)ADC_Channel << (5 * (Rank - 13));

    tmpreg1 |= tmpreg2;

    ADCx->SQR1 = tmpreg1;
  }
  }

CS_CMM_PROBE_NODE_STMT(10,1,9) 
 CODESCROLL_FUNC_END(19, 1, 676) } CODESCROLL_FUNC_END_RBRACE 
/* # 685 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_ExternalTrigConvCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(20, (20, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable58,51) 

  
  CS_CMM_PROBE_NODE_STMT(10,0,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(11,7,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable59,52) 

    
    CS_CMM_PROBE_NODE_STMT(11,6,2) ADCx->CR2 |= ((uint32_t)0x00100000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable60,53) 

    
    CS_CMM_PROBE_NODE_STMT(11,5,3) ADCx->CR2 &= ((uint32_t)0xFFEFFFFF);
  }

CS_CMM_PROBE_NODE_STMT(11,4,4) 
 CODESCROLL_FUNC_END(20, 1, 700) } CODESCROLL_FUNC_END_RBRACE 






uint16_t ADC_GetConversionValue(ADC_TypeDef* ADCx)
{ CODESCROLL_FUNC_BEGIN(21, (21, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable61,54) 

  
  CS_CMM_PROBE_NODE_STMT(11,3,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(11,2,1) 
   CODESCROLL_FUNC_END(21, 1, 712) return (uint16_t) ADCx->DR;
} CODESCROLL_FUNC_END_RBRACE 





uint32_t ADC_GetDualModeConversionValue(void)
{ CODESCROLL_FUNC_BEGIN(22, (22, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable62,55) 

  
  CS_CMM_PROBE_NODE_STMT(11,1,0) 
  CS_CMM_PROBE_NODE_STMT(11,0,1) 
   CODESCROLL_FUNC_END(22, 1, 722) return (*(volatile uint32_t *) ((uint32_t)0x4001244C));
} CODESCROLL_FUNC_END_RBRACE 
/* # 733 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_AutoInjectedConvCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(23, (23, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable63,56) 

  
  CS_CMM_PROBE_NODE_STMT(12,7,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(12,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable64,57) 

    
    CS_CMM_PROBE_NODE_STMT(12,5,2) ADCx->CR1 |= ((uint32_t)0x00000400);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable65,58) 

    
    CS_CMM_PROBE_NODE_STMT(12,4,3) ADCx->CR1 &= ((uint32_t)0xFFFFFBFF);
  }

CS_CMM_PROBE_NODE_STMT(12,3,4) 
 CODESCROLL_FUNC_END(23, 1, 748) } CODESCROLL_FUNC_END_RBRACE 
/* # 759 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_InjectedDiscModeCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(24, (24, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable66,59) 

  
  CS_CMM_PROBE_NODE_STMT(12,2,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(12,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable67,60) 

    
    CS_CMM_PROBE_NODE_STMT(12,0,2) ADCx->CR1 |= ((uint32_t)0x00001000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable68,61) 

    
    CS_CMM_PROBE_NODE_STMT(13,7,3) ADCx->CR1 &= ((uint32_t)0xFFFFEFFF);
  }

CS_CMM_PROBE_NODE_STMT(13,6,4) 
 CODESCROLL_FUNC_END(24, 1, 774) } CODESCROLL_FUNC_END_RBRACE 
/* # 798 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_ExternalTrigInjectedConvConfig(ADC_TypeDef* ADCx, uint32_t ADC_ExternalTrigInjecConv)
{ CODESCROLL_FUNC_BEGIN(25, (25, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable69,62) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable70,13,5,0)

  uint32_t tmpreg = 0;

  ((void)0);
  ((void)0);

  tmpreg = ADCx->CR2;

  tmpreg &= ((uint32_t)0xFFFF8FFF);

  tmpreg |= ADC_ExternalTrigInjecConv;

  ADCx->CR2 = tmpreg;

CS_CMM_PROBE_NODE_STMT(13,4,1) 
 CODESCROLL_FUNC_END(25, 1, 812) } CODESCROLL_FUNC_END_RBRACE 
/* # 823 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_ExternalTrigInjectedConvCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(26, (26, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable71,63) 

  
  CS_CMM_PROBE_NODE_STMT(13,3,0) ((void)0);
  ((void)0);
  
