irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_adc_515_IUT.c
  CS_CMM_PROBE_NODE_STMT(13,2,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable72,64) 

    
    CS_CMM_PROBE_NODE_STMT(13,1,2) ADCx->CR2 |= ((uint32_t)0x00008000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable73,65) 

    
    CS_CMM_PROBE_NODE_STMT(13,0,3) ADCx->CR2 &= ((uint32_t)0xFFFF7FFF);
  }

CS_CMM_PROBE_NODE_STMT(14,7,4) 
 CODESCROLL_FUNC_END(26, 1, 838) } CODESCROLL_FUNC_END_RBRACE 
/* # 848 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_SoftwareStartInjectedConvCmd(ADC_TypeDef* ADCx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(27, (27, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable74,66) 

  
  CS_CMM_PROBE_NODE_STMT(14,6,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(14,5,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable75,67) 


    
    CS_CMM_PROBE_NODE_STMT(14,4,2) ADCx->CR2 |= ((uint32_t)0x00208000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable76,68) 


    
    CS_CMM_PROBE_NODE_STMT(14,3,3) ADCx->CR2 &= ((uint32_t)0xFFDF7FFF);
  }

CS_CMM_PROBE_NODE_STMT(14,2,4) 
 CODESCROLL_FUNC_END(27, 1, 865) } CODESCROLL_FUNC_END_RBRACE 






FlagStatus ADC_GetSoftwareStartInjectedConvCmdStatus(ADC_TypeDef* ADCx)
{ CODESCROLL_FUNC_BEGIN(28, (28, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable77,69) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable78,14,1,0)

  FlagStatus bitstatus = RESET;

  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(14,0,1) if ((ADCx->CR2 & ((uint32_t)0x00200000)) != (uint32_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable79,70) 

    
    CS_CMM_PROBE_NODE_STMT(15,7,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable80,71) 

    
    CS_CMM_PROBE_NODE_STMT(15,6,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(15,5,4) 
   CODESCROLL_FUNC_END(28, 1, 889) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 929 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_InjectedChannelConfig(ADC_TypeDef* ADCx, uint8_t ADC_Channel, uint8_t Rank, uint8_t ADC_SampleTime)
{ CODESCROLL_FUNC_BEGIN(29, (29, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable81,72) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable82,15,4,0)

  uint32_t tmpreg1 = 0, tmpreg2 = 0, tmpreg3 = 0;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(15,3,1) if (ADC_Channel > ((uint8_t)0x09))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable83,73) 

    
    CS_CMM_PROBE_NODE_STMT(15,2,2) tmpreg1 = ADCx->SMPR1;

    tmpreg2 = ((uint32_t)0x00000007) << (3*(ADC_Channel - 10));

    tmpreg1 &= ~tmpreg2;

    tmpreg2 = (uint32_t)ADC_SampleTime << (3*(ADC_Channel - 10));

    tmpreg1 |= tmpreg2;

    ADCx->SMPR1 = tmpreg1;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable84,74) 

    
    CS_CMM_PROBE_NODE_STMT(15,1,3) tmpreg1 = ADCx->SMPR2;

    tmpreg2 = ((uint32_t)0x00000007) << (3 * ADC_Channel);

    tmpreg1 &= ~tmpreg2;

    tmpreg2 = (uint32_t)ADC_SampleTime << (3 * ADC_Channel);

    tmpreg1 |= tmpreg2;

    ADCx->SMPR2 = tmpreg1;
  }


  
  CS_CMM_PROBE_NODE_STMT(15,0,4) tmpreg1 = ADCx->JSQR;

  tmpreg3 = (tmpreg1 & ((uint32_t)0x00300000))>> 20;

  tmpreg2 = ((uint32_t)0x0000001F) << (5 * (uint8_t)((Rank + 3) - (tmpreg3 + 1)));

  tmpreg1 &= ~tmpreg2;

  tmpreg2 = (uint32_t)ADC_Channel << (5 * (uint8_t)((Rank + 3) - (tmpreg3 + 1)));

  tmpreg1 |= tmpreg2;

  ADCx->JSQR = tmpreg1;

CS_CMM_PROBE_NODE_STMT(16,7,5) 
 CODESCROLL_FUNC_END(29, 1, 983) } CODESCROLL_FUNC_END_RBRACE 
/* # 992 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_InjectedSequencerLengthConfig(ADC_TypeDef* ADCx, uint8_t Length)
{ CODESCROLL_FUNC_BEGIN(30, (30, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable85,75) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable86,16,6,0)

  uint32_t tmpreg1 = 0;
  uint32_t tmpreg2 = 0;

  ((void)0);
  ((void)0);


  tmpreg1 = ADCx->JSQR;

  tmpreg1 &= ((uint32_t)0xFFCFFFFF);

  tmpreg2 = Length - 1;
  tmpreg1 |= tmpreg2 << 20;

  ADCx->JSQR = tmpreg1;

CS_CMM_PROBE_NODE_STMT(16,5,1) 
 CODESCROLL_FUNC_END(30, 1, 1009) } CODESCROLL_FUNC_END_RBRACE 
/* # 1024 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_SetInjectedOffset(ADC_TypeDef* ADCx, uint8_t ADC_InjectedChannel, uint16_t Offset)
{ CODESCROLL_FUNC_BEGIN(31, (31, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable87,76) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable88,16,4,0)

  volatile uint32_t tmp = 0;


  ((void)0);
  ((void)0);
  ((void)0);

  tmp = (uint32_t)ADCx;
  tmp += ADC_InjectedChannel;


  *(volatile uint32_t *) tmp = (uint32_t)Offset;

CS_CMM_PROBE_NODE_STMT(16,3,1) 
 CODESCROLL_FUNC_END(31, 1, 1038) } CODESCROLL_FUNC_END_RBRACE 
/* # 1051 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
uint16_t ADC_GetInjectedConversionValue(ADC_TypeDef* ADCx, uint8_t ADC_InjectedChannel)
{ CODESCROLL_FUNC_BEGIN(32, (32, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable89,77) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable90,16,2,0)

  volatile uint32_t tmp = 0;


  ((void)0);
  ((void)0);

  tmp = (uint32_t)ADCx;
  tmp += ADC_InjectedChannel + ((uint8_t)0x28);


  
  CS_CMM_PROBE_NODE_STMT(16,1,1) 
   CODESCROLL_FUNC_END(32, 1, 1063) return (uint16_t) (*(volatile uint32_t*) tmp);
} CODESCROLL_FUNC_END_RBRACE 
/* # 1081 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_AnalogWatchdogCmd(ADC_TypeDef* ADCx, uint32_t ADC_AnalogWatchdog)
{ CODESCROLL_FUNC_BEGIN(33, (33, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable91,78) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable92,16,0,0)

