irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_adc_515_IUT.c
  uint32_t tmpreg = 0;

  ((void)0);
  ((void)0);

  tmpreg = ADCx->CR1;

  tmpreg &= ((uint32_t)0xFF3FFDFF);

  tmpreg |= ADC_AnalogWatchdog;

  ADCx->CR1 = tmpreg;

CS_CMM_PROBE_NODE_STMT(17,7,1) 
 CODESCROLL_FUNC_END(33, 1, 1095) } CODESCROLL_FUNC_END_RBRACE 
/* # 1106 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_AnalogWatchdogThresholdsConfig(ADC_TypeDef* ADCx, uint16_t HighThreshold,
                                        uint16_t LowThreshold)
{ CODESCROLL_FUNC_BEGIN(34, (34, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable93,79) 

  
  CS_CMM_PROBE_NODE_STMT(17,6,0) ((void)0);
  ((void)0);
  ((void)0);

  ADCx->HTR = HighThreshold;

  ADCx->LTR = LowThreshold;

CS_CMM_PROBE_NODE_STMT(17,5,1) 
 CODESCROLL_FUNC_END(34, 1, 1117) } CODESCROLL_FUNC_END_RBRACE 
/* # 1144 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_AnalogWatchdogSingleChannelConfig(ADC_TypeDef* ADCx, uint8_t ADC_Channel)
{ CODESCROLL_FUNC_BEGIN(35, (35, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable94,80) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable95,17,4,0)

  uint32_t tmpreg = 0;

  ((void)0);
  ((void)0);

  tmpreg = ADCx->CR1;

  tmpreg &= ((uint32_t)0xFFFFFFE0);

  tmpreg |= ADC_Channel;

  ADCx->CR1 = tmpreg;

CS_CMM_PROBE_NODE_STMT(17,3,1) 
 CODESCROLL_FUNC_END(35, 1, 1158) } CODESCROLL_FUNC_END_RBRACE 







void ADC_TempSensorVrefintCmd(FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(36, (36, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable96,81) 

  
  CS_CMM_PROBE_NODE_STMT(17,2,0) ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(17,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable97,82) 

    
    CS_CMM_PROBE_NODE_STMT(17,0,2) ((ADC_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2400))->CR2 |= ((uint32_t)0x00800000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable98,83) 

    
    CS_CMM_PROBE_NODE_STMT(18,7,3) ((ADC_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2400))->CR2 &= ((uint32_t)0xFF7FFFFF);
  }

CS_CMM_PROBE_NODE_STMT(18,6,4) 
 CODESCROLL_FUNC_END(36, 1, 1180) } CODESCROLL_FUNC_END_RBRACE 
/* # 1194 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
FlagStatus ADC_GetFlagStatus(ADC_TypeDef* ADCx, uint8_t ADC_FLAG)
{ CODESCROLL_FUNC_BEGIN(37, (37, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable99,84) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable100,18,5,0)

  FlagStatus bitstatus = RESET;

  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(18,4,1) if ((ADCx->SR & ADC_FLAG) != (uint8_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable101,85) 

    
    CS_CMM_PROBE_NODE_STMT(18,3,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable102,86) 

    
    CS_CMM_PROBE_NODE_STMT(18,2,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(18,1,4) 
   CODESCROLL_FUNC_END(37, 1, 1212) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1227 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_ClearFlag(ADC_TypeDef* ADCx, uint8_t ADC_FLAG)
{ CODESCROLL_FUNC_BEGIN(38, (38, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable103,87) 

  
  CS_CMM_PROBE_NODE_STMT(18,0,0) ((void)0);
  ((void)0);

  ADCx->SR = ~(uint32_t)ADC_FLAG;

CS_CMM_PROBE_NODE_STMT(19,7,1) 
 CODESCROLL_FUNC_END(38, 1, 1234) } CODESCROLL_FUNC_END_RBRACE 
/* # 1246 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
ITStatus ADC_GetITStatus(ADC_TypeDef* ADCx, uint16_t ADC_IT)
{ CODESCROLL_FUNC_BEGIN(39, (39, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable104,88) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable105,19,6,0)

  ITStatus bitstatus = RESET;
  uint32_t itmask = 0, enablestatus = 0;

  ((void)0);
  ((void)0);

  itmask = ADC_IT >> 8;

  enablestatus = (ADCx->CR1 & (uint8_t)ADC_IT) ;

  
  CS_CMM_PROBE_NODE_STMT(19,5,1) if (CS_MCDC_39_0(((ADCx->SR & itmask) != (uint32_t)RESET), enablestatus, 0))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable106,0) 

    
    CS_CMM_PROBE_NODE_STMT(19,4,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable107,1) 

    
    CS_CMM_PROBE_NODE_STMT(19,3,3) bitstatus = RESET;
  }

  
  CS_CMM_PROBE_NODE_STMT(19,2,4) 
   CODESCROLL_FUNC_END(39, 1, 1269) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 1282 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_adc.c"*/
void ADC_ClearITPendingBit(ADC_TypeDef* ADCx, uint16_t ADC_IT)
{ CODESCROLL_FUNC_BEGIN(40, (40, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable108,89) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable109,19,1,0)

  uint8_t itmask = 0;

  ((void)0);
  ((void)0);

  itmask = (uint8_t)(ADC_IT >> 8);

  ADCx->SR = ~(uint32_t)itmask;

CS_CMM_PROBE_NODE_STMT(19,0,1) 
 CODESCROLL_FUNC_END(40, 1, 1292) } CODESCROLL_FUNC_END_RBRACE 
